blog-posts/2004-12-11-evolution-as-a-planner-user.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Evolution as a Planner user</title>
<!-- 2014-04-30 Wed 17:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Evolution as a Planner user</h1>
<p>
December 11th, 2004 -
<a href="http://sachachua.com/blog/p/2482"><a href="http://sachachua.com/blog/p/2482">http://sachachua.com/blog/p/2482</a></a>
</p>

<p>
(Posted to emacs-wiki-discuss some time back.)
</p>

<p>
Me, I started by using Planner+Remember to scribble down random
 thoughts and put them somewhere publishable. It's kinda funny. Here's
 the very first entry I have on 2001.11.02:
</p>

<hr  />

<pre class="example">
.#1 Playing with planner (linux, emacs)

Today's been a busy day. I don't suppose I can get planner to nicely
work with all the rest of emacs, can it? I rather like emacswiki...

Alright, seems to be fine. Planner's actually pretty nifty. I'll pop
the description into my remembrance agent index on the next scan, I
suppose; maybe it'll be useful.

I wonder if I can get the wiki to recognize non-wiki words. That would
be pretty nice.

Off to dinner with me now.
</pre>

<hr  />

<p>
Used it for a week, then stopped using it. Resumed on 2002.06.20,
 having discovered remember-mode and the joys of blogging. For two
 months, used planner as a blog.
</p>

<p>
Then my 2002.08.17 epiphany note:
</p>

<hr  />

<pre class="example">
.#1 Planner is actually quite useful. So is emacs-wiki.
</pre>

<hr  />

<p>
That was when I started really using tasks. They were linked to
 project pages, but I didn't have Gnus integration then. The first time
 I created a task based on an e-mail message seems to have been
 2003.07.31. Almost a year of using Planner as just a blog, and that
 was before planner-rss.el!
</p>

<p>
It took me another 8 months to realize that it would be a good idea if
 I could make a task from an e-mail message \<sub>and\</sub>_ assign it to a plan
 page. My first such task is on my 2004.03.12 entry. (That's this year!)
</p>

<p>
Somewhere along the way, we added a few modules for integrating with
 other parts of Emacs, so we moved to more flexible URL handling. The
 number of modules increased even more. People add stuff to link to
 whatever they use frequently. For example, I added the planner-erc
 module so that I could keep track of who asked for what planner
 feature on #emacs&#x2026; \<sup>\</sup><sub>\</sub>^
</p>

<p>
So don't worry, you don't have to start with a really funky Planner
 config. Use whatever you feel like using. Feel free to ask questions.
 If something is missing, we'll try to see if we can hack it in. =)
</p>

<p>
By the way, you don't need to remember the history of planner. I
 didn't realize I took \<sub>that\</sub>_ long to come up with obvious tweaks
until
 I, err, reviewed my planner files in the course of writing this
 message. That's why this community is such a wonderful, wonderful
 resource. People come up with all the coolest things&#x2026; =)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
